# # Условный оператор if
#
# Inp = int(input())
#
# if Inp > 0:
#     print('+')
# else:
#     print('-')

# # Условный оператор else
#
# N = int(input())
#
# if N <= 40:
#     print('Пересдача')
# elif 40 < N <= 59:
#     print('Оценка: 3')
# elif 60 <= N <= 79:
#     print('Оценка: 4')
# else:
#     print('Оценка: 5')

# # Тернарный оператор
# # <если условие истинно> if <условие> else <если условие ложно>
#
# num = int(input())
#
# if num > 0:
#     print('+')
# else:
#     print('-')
#
# # ЭТО ТЕРНАРНЫЙ ОПЕРАТОР, КОТОРЫЙ СВЕРНУЛ ВЕРХНИЕ 4 СТРОЧИК В ОДНУ
# print('TRUE' if num > 0 else 'FALSE')

# Логические операции
# <, <=, >, >=, ==, !=
# not, and, or
